package duclass.duclass.a1_sub_class;

public class ClassData {
	
	public String[] data = {"기타 교양","인문대","법과대","행정대","경상대","사회과학대"
			,"자연과학대","공과대","정보통신대","생명환경대","조형예술대"
			,"사범대","재활과학대","기초교육대","간호보건학부"};
	
	public String[] s0 ={"선택 없음"};
	public String[] s1 = {"전체","국어국문학과","중국어중국학과","일본어일본학과","러시아어러시아학과","영어영문학과"
		,"독어독문학과","불어불문학과","체육학과","스포츠레저학과","건강증진학과"
		,"골프산업학과","국제한국어교육과"};
	public String[] s2 = {"전체","공법학전공","사법학전공","공공안전법학전공"};
	public String[] s3 = {"전체","행정학과","경찰행정학과","도시행정학과","지역사회개발,복지학과","도시,지역계획학과"
		,"부동산학과"};
	public String[] s4 = {"전체","경제학과","무역학과","경영학과","회계학과","금융보험학과"
		,"관광경영학과","호텔관광학과"};
	public String[] s5 = {"전체","사회복지학과","산업복지학과","가정복지학과","국제관계학과","사회학과"
		,"신문방송학과","문헌정보학과","심리학과"};
	public String[] s6 = {"전체","수학과","전산통계학과","물리학과","화학 응용화학과","생명과학과"
		,"의생명과학과"};
	public String[] s7 = {"전체","건축공학과","토목공학과","환경공학과","식품공학과","기계 자동차공학부"
		,"기계공학전공","자동차공학전공","식품영양학과","생명공학과","화학공학과"
		,"조경학과","산업경영공학과","기계융복합공학과"};
	public String[] s8 = {"전체","전자전기공학부","정보통신공학부","컴퓨터IT공학부","전산공학","정보공학"
		,"IT융합학과","메카트로닉스공학과"};
	public String[] s9 = {"전체","원예학과","동물자원학과","산림자원학과","생명환경학부","바이오산업학"
		,"식품환경안전학"};
	public String[] s10 = {"전체","회화과","시각디자인학과","영상애니메이션디자인학과","산업디자인학과","생활조형디자인학과"
		,"패션디자인학과","실내건축디자인학과"};
	public String[] s11 = {"전체","국어교육과","영어교육과","역사교육과","일반사회교육과","지리교육과"
		,"유아교육과","특수교육과","초등특수교육과","유아특수교육과","수학교육과"
		,"과학교육학부","물리교육","화학교육","화학교육","생물교육","과학교육학부"};
	public String[] s12 = {"전체","직업재활학과","언어치료학과","재활심리학과","재활공학과","물리치료학과"
		,"작업치료학과","건강증진학과"};
	public String[] s13 = {"전체"};
	public String[] s14 = {"전체","간호학과","보건행정학과"};

}
